In [1]:
import pandas as pd

In [8]:
df1 = pd.DataFrame({"a":["python","java"],
                   "b" : ["apple", "mango"]}, index = [1,2])
df1

        a      b
1  python  apple
2    java  mango

In [25]:
df2 = pd.DataFrame({"a":["c","c++"],
                   "b" : ["banana", "cherry"],
                   "c" : ["hive","oozie"]}, index=[4,5])
df2

     a       b      c
4    c  banana   hive
5  c++  cherry  oozie

In [26]:
df3 = pd.concat([df1,df2])
df3

        a       b      c
1  python   apple    NaN
2    java   mango    NaN
4       c  banana   hive
5     c++  cherry  oozie

In [27]:
pd.merge(df1,df2)

Empty DataFrame
Columns: [a, b, c]
Index: []

# Merge

In [38]:
# merge me same hona chahiye.

import pandas as pd
var1 = pd.DataFrame({"A":[1,2,3,4], "B":[11,12,13,14]})
var1

   A   B
0  1  11
1  2  12
2  3  13
3  4  14

In [53]:
var2 = pd.DataFrame({"A":[1,2,3,4], "B":[21,22,23,24]})
var2

   A   B
0  1  21
1  2  22
2  3  23
3  4  24

In [54]:
pd.merge(var1,var2, on="A")

   A  B_x  B_y
0  1   11   21
1  2   12   22
2  3   13   23
3  4   14   24

In [46]:
# merge hone ke liye dono dataframe me se ek key value should be same.

In [48]:
pd.merge(var1,var2, how = "right")

   A   B
0  1  21
1  2  22
2  3  23
3  4  24

# concat

In [50]:
df1 = pd.DataFrame({"A":[1,2,3,4], "B":[11,12,13,14]})
df1

   A   B
0  1  11
1  2  12
2  3  13
3  4  14

In [73]:
df2 = pd.DataFrame({"A":[1,2,3,5], "B":[21,22,23,24]})
df2

    c
0  21
1  22
2  23
3  24

In [74]:
pd.concat([df1,df2])

     A     B     c
0  1.0  11.0   NaN
1  2.0  12.0   NaN
2  3.0  13.0   NaN
3  4.0  14.0   NaN
0  NaN   NaN  21.0
1  NaN   NaN  22.0
2  NaN   NaN  23.0
3  NaN   NaN  24.0

In [60]:
pd.concat([df1,df2],axis=1)

   A   B  A   B
0  1  11  1  21
1  2  12  2  22
2  3  13  3  23
3  4  14  5  24

In [61]:
# merge me kuch same list is not compulsory

# join

In [72]:
# (also work with unmathced data)

In [82]:
var1 = pd.DataFrame({"A":[1,2,3,4], "B":[11,12,13,14]})
var2 = pd.DataFrame({"C":[10,20,30,40], "D":[21,22,23,24]})

var1.join(var2)
# join (left side)

   A   B   C   D
0  1  11  10  21
1  2  12  20  22
2  3  13  30  23
3  4  14  40  24

In [83]:
var1 = pd.DataFrame({"A":[1,2,3,4], "B":[11,12,13,14]})
var2 = pd.DataFrame({"C":[10,20], "D":[21,22]})

var1.join(var2)

   A   B     C     D
0  1  11  10.0  21.0
1  2  12  20.0  22.0
2  3  13   NaN   NaN
3  4  14   NaN   NaN

In [84]:
var1.append(var2)

AttributeError: 'DataFrame' object has no attribute 'append'

In [ ]:
# revise
merge = dono me kuch same hona chaiye
concat = not same require. concat below. work like stack
join = also work with unmatched data. concate side bu